# Brewfile — desired go-forward state for this Mac.
# Homebrew owns the package managers (mise, pixi) and CLI tooling.
# Apply with:  brew bundle --file=Brewfile
# NOTE: this captures the CURRENT intentional installs; nothing here
#       uninstalls anything. Regenerate with: brew bundle dump --force

tap "1password/tap"
tap "golangci/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "secureauthcorp/tap", "https://github.com/SecureAuthCorp/homebrew-tap.git"
tap "ubuntu/microk8s"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Dependency-aware issue tracker (bd) used by AI agent workflows
brew "beads"
# Vector graphics library with cross-device output support
brew "cairo"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Modern, maintained replacement for ls
brew "eza"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# Multi-format archive and compression library
brew "libarchive"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Cross-platform application and UI framework
brew "qt"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GNU grep, egrep and fgrep
brew "grep"
# Development kit for the Java programming language
brew "openjdk"
# Java-based scripting language
brew "groovy"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Improved top (interactive process viewer)
brew "htop"
# Display an interface's bandwidth usage
brew "iftop"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Modular IRC client
brew "irssi"
# Convert JPG images to ASCII
brew "jp2a"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Update LDAP entries with a text editor
brew "ldapvi"
# Build tool for Clojure
brew "leiningen"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
brew "pixi" # was self-installed at ~/.pixi/bin; migrate to brew (see revamp notes)
# Utility for managing network connections
brew "netcat"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Capability-based sandbox shell for AI agents with OS-enforced isolation
brew "nono"
# User-friendly CLI for OAuth2
brew "oauth2c"
# Open source suite of directory software
brew "openldap"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Highly capable, feature-rich programming language
brew "perl"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Command-line shell and scripting language
brew "powershell", link: false
# Print the IP addresses in a given range
brew "prips"
# Python version management
brew "pyenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# Autoformat shell script source code
brew "shfmt"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Terminal-based client for Spotify
brew "spotify-tui"
# Spotify daemon
brew "spotifyd", restart_service: :changed
# Cross-shell prompt for astronauts
brew "starship"
# Tool Command Language
brew "tcl-tk"
# User interface to the TELNET protocol
brew "telnet"
# Send macOS notifications from the command line (Claude Code hook notifier)
brew "terminal-notifier"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Simple GTD-style task management for the command-line
brew "ultralist"
# Extraction utility for .zip compressed archives
brew "unzip"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Bash completion for Vagrant
brew "vagrant-completion"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Internet file retriever
brew "wget"
# Fast CSV toolkit written in Rust
brew "xsv"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Command-line interface for 1Password
cask "1password-cli"
# Eclipse-based LDAP browser and directory client
cask "apache-directory-studio"
# Virtual Audio Driver
cask "blackhole-16ch"
# 3D creation suite
cask "blender"
# Free and open-source web browser
cask "chromium"
# Terminal-based AI coding assistant
cask "claude-code"
# Terminal emulator mimicking the old cathode display
cask "cool-retro-term"
# API documentation browser and code snippet manager
cask "dash"
# Voice and text chat software
cask "discord"
# Emulator to play GameCube and Wii games
cask "dolphin"
# Tool to hide status bar icons
cask "dozer"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source screen recorder built with web technology
cask "kap"
# Adaptive brightness for external displays
cask "lunar"
# Multi-platform web browser
cask "microsoft-edge"
# Icon manager
cask "noun-project"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Retro video game emulation
cask "openemu"
# Programmable solid 3D CAD modeller
cask "openscad@snapshot"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Command-line shell and scripting language
cask "powershell"
# IDE for professional Python development
cask "pycharm"
# Quick Look plugin for JSON files
cask "quicklook-json"
# Text editor for code, markup and prose
cask "sublime-text"
# Development environment
cask "vagrant"
cask "vagrant-manager"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# X Certificate and Key management
cask "xca"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Video communication and virtual meeting platform
cask "zoom"
vscode "andyyaldoo.vscode-json"
vscode "anteprimorac.html-end-tag-labels"
vscode "anthropic.claude-code"
vscode "arjun.swagger-viewer"
vscode "asciidoctor.asciidoctor-vscode"
vscode "astro-build.astro-vscode"
vscode "atlassian.atlascode"
vscode "bierner.emojisense"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "blackmist.linkcheckmd"
vscode "bmuskalla.vscode-tldr"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "chrischinchilla.vscode-pandoc"
vscode "christianalexander.flip"
vscode "codezombiech.gitignore"
vscode "compilenix.vscode-zonefile"
vscode "compulim.compulim-vscode-dictionary"
vscode "davidanson.vscode-markdownlint"
vscode "deepnote.vscode-deepnote"
vscode "dnicolson.binary-plist"
vscode "docsmsft.docs-article-templates"
vscode "docsmsft.docs-authoring-pack"
vscode "docsmsft.docs-images"
vscode "docsmsft.docs-linting"
vscode "docsmsft.docs-markdown"
vscode "docsmsft.docs-metadata"
vscode "docsmsft.docs-preview"
vscode "docsmsft.docs-yaml"
vscode "dotjoshjohnson.xml"
vscode "dougfinke.vscode-pandoc"
vscode "eamodio.gitlens"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-highlight"
vscode "fabiospampinato.vscode-search-open-all-results"
vscode "fabiospampinato.vscode-todo-plus"
vscode "foxundermoon.shell-format"
vscode "ginfuru.ginfuru-better-solarized-dark-theme"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "heaths.vscode-guid"
vscode "jbockle.jbockle-format-files"
vscode "jianbingfang.dupchecker"
vscode "jock.svg"
vscode "johnpapa.winteriscoming"
vscode "learningengineeringoperations.learn-training-ai-assistant"
vscode "leighlondon.eml"
vscode "lukapetrovic.image-resizer"
vscode "luqimin.velocity"
vscode "mechatroner.rainbow-csv"
vscode "mermade.openapi-lint"
vscode "mhutchie.git-graph"
vscode "mikebovenlander.formate"
vscode "mitchdenny.ecdc"
vscode "monokai.theme-monokai-pro-vscode"
vscode "mrmlnc.vscode-apache"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vsliveshare.vsliveshare"
vscode "nmsmith89.incrementor"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rmnl.theme-solarized-flat-dark"
vscode "rogalmic.bash-debug"
vscode "shardulm94.trailing-spaces"
vscode "sidthesloth.html5-boilerplate"
vscode "sleistner.vscode-fileutils"
vscode "somekittens.hot-dog-stand"
vscode "spmeesseman.vscode-taskexplorer"
vscode "sryze.uridecode"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "stripe.markdoc-language-support"
vscode "tamasfe.even-better-toml"
vscode "tberman.json-schema-validator"
vscode "threadheap.serverless-ide-vscode"
vscode "tomashubelbauer.vscode-markdown-table-format"
vscode "tomoki1207.pdf"
vscode "tomoki1207.selectline-statusbar"
vscode "tuxtina.json2yaml"
vscode "twxs.cmake"
vscode "tyriar.lorem-ipsum"
vscode "tyriar.sort-lines"
vscode "vue.volar"
vscode "whizkydee.material-palenight-theme"
vscode "wmaurer.change-case"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/gopls"
npm "corepack"
npm "socket"
